Revit 2017 API
AssetProperty.Type Property
Returns the type of the AssetProperty
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public AssetPropertyType Type { get; }
Visual Basic
Public ReadOnly Property Type As AssetPropertyType
	Get
Visual C++
public:
property AssetPropertyType Type {
	AssetPropertyType get ();
}
See Also
AssetProperty Class
Autodesk.Revit.Utility Namespace